bentPipe-series/blockMesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version    2.0;
    format     ascii;
    class      dictionary;
    object     blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ======================= MESH PARAMETERS ============================ //
// Note: Using OpenFOAM-13 compatible syntax (variable value;)
// Note: Using separate variables for negative values for robustness.

// --- Geometric Parameters [mm] ---
pipeRadiusOuter  10;        // Pipe outer radius (for 20mm diameter)
pipeRadiusInner  7;         // Inner radius of the O-grid blocks
bendRadius       30;        // Radius of the 90-degree bend
length1          200;       // Length of inlet straight section
length2          400;       // Length of outlet straight section

// --- Derived Geometric Parameters for 45-degree O-Grid ---
// Outer vertices are on a circle of radius 10mm
pRo_45  7.07107;  // pipeRadiusOuter / sqrt(2)
nRo_45 -7.07107;
// Inner vertices are on a circle of radius 7mm
pRi_45  4.94975;  // pipeRadiusInner / sqrt(2)
nRi_45 -4.94975;

// --- Cell Counts ---
nCellsR      8;         // Cells in radial direction
nCellsC      12;        // Cells in circumferential direction (per quadrant)
nCellsL1     100;       // Cells along the inlet straight section
nCellsBend   40;        // Cells along the bend
nCellsL2     200;       // Cells along the outlet straight section
wallGrading  0.5;      // Grading towards the wall
// ==================================================================== //

convertToMeters 1e-3;

vertices
(
    // === Section 1: Inlet Straight (y=0 to y=200) ===
    // Vertices at y=0 (Inlet plane)
    ($nRi_45 0 $pRi_45)     // 0
    ($nRo_45 0 $pRo_45)     // 1
    ($pRo_45 0 $pRo_45)     // 2
    ($pRi_45 0 $pRi_45)     // 3
    ($pRi_45 0 $nRi_45)     // 4
    ($pRo_45 0 $nRo_45)     // 5
    ($nRo_45 0 $nRo_45)     // 6
    ($nRi_45 0 $nRi_45)     // 7
    // Vertices at y=length1=200 (start of bend)
    ($nRi_45 $length1 $pRi_45)  // 8
    ($nRo_45 $length1 $pRo_45)  // 9
    ($pRo_45 $length1 $pRo_45)  // 10
    ($pRi_45 $length1 $pRi_45)  // 11
    ($pRi_45 $length1 $nRi_45)  // 12
    ($pRo_45 $length1 $nRo_45)  // 13
    ($nRo_45 $length1 $nRo_45)  // 14
    ($nRi_45 $length1 $nRi_45)  // 15

    // === Section 2: Bend (from y=200 to z=30) ===
    // Centerline ends at (0, 200+30, 30) = (0, 230, 30)
    // Vertices at end of bend
    (-4.94975 225.05025 30)    // 16
    (-7.07107 222.92893 30)    // 17
    (7.07107  222.92893 30)    // 18
    (4.94975  225.05025 30)    // 19
    (4.94975  234.94975 30)    // 20
    (7.07107  237.07107 30)    // 21
    (-7.07107 237.07107 30)    // 22
    (-4.94975 234.94975 30)    // 23

    // === Section 3: Outlet Straight (to z=30+400=430) ===
    // Vertices at Outlet plane
    (-4.94975 225.05025 430)   // 24
    (-7.07107 222.92893 430)   // 25
    (7.07107  222.92893 430)   // 26
    (4.94975  225.05025 430)   // 27
    (4.94975  234.94975 430)   // 28
    (7.07107  237.07107 430)   // 29
    (-7.07107 237.07107 430)   // 30
    (-4.94975 234.94975 430)   // 31
);

blocks
(
    hex (0 1 2 3 8 9 10 11)      ($nCellsR $nCellsC $nCellsL1)  simpleGrading ($wallGrading 1 1)
    hex (3 2 5 4 11 10 13 12)    ($nCellsR $nCellsC $nCellsL1)  simpleGrading ($wallGrading 1 1)
    hex (4 5 6 7 12 13 14 15)    ($nCellsR $nCellsC $nCellsL1)  simpleGrading ($wallGrading 1 1)
    hex (7 6 1 0 15 14 9 8)      ($nCellsR $nCellsC $nCellsL1)  simpleGrading ($wallGrading 1 1)
    hex (0 3 4 7 8 11 12 15)     ($nCellsC $nCellsC $nCellsL1)  simpleGrading (1 1 1)

    hex (8 9 10 11 16 17 18 19)  ($nCellsR $nCellsC $nCellsBend) simpleGrading ($wallGrading 1 1)
    hex (11 10 13 12 19 18 21 20)($nCellsR $nCellsC $nCellsBend) simpleGrading ($wallGrading 1 1)
    hex (12 13 14 15 20 21 22 23)($nCellsR $nCellsC $nCellsBend) simpleGrading ($wallGrading 1 1)
    hex (15 14 9 8 23 22 17 16)  ($nCellsR $nCellsC $nCellsBend) simpleGrading ($wallGrading 1 1)
    hex (8 11 12 15 16 19 20 23) ($nCellsC $nCellsC $nCellsBend) simpleGrading (1 1 1)

    hex (16 17 18 19 24 25 26 27)($nCellsR $nCellsC $nCellsL2)  simpleGrading ($wallGrading 1 1)
    hex (19 18 21 20 27 26 29 28)($nCellsR $nCellsC $nCellsL2)  simpleGrading ($wallGrading 1 1)
    hex (20 21 22 23 28 29 30 31)($nCellsR $nCellsC $nCellsL2)  simpleGrading ($wallGrading 1 1)
    hex (23 22 17 16 31 30 25 24)($nCellsR $nCellsC $nCellsL2)  simpleGrading ($wallGrading 1 1)
    hex (16 19 20 23 24 27 28 31)($nCellsC $nCellsC $nCellsL2)  simpleGrading (1 1 1)
);

edges
(
    // Arcs for circular cross-sections
    arc 1 2  (0 0 10)
    arc 2 5  (10 0 0)
    arc 5 6  (0 0 -10)
    arc 6 1  (-10 0 0)
    arc 0 3  (0 0 7)
    arc 3 4  (7 0 0)
    arc 4 7  (0 0 -7)
    arc 7 0  (-7 0 0)

    arc 9 10 (0 200 10)
    arc 10 13 (10 200 0)
    arc 13 14 (0 200 -10)
    arc 14 9 (-10 200 0)
    arc 8 11 (0 200 7)
    arc 11 12 (7 200 0)
    arc 12 15 (0 200 -7)
    arc 15 8 (-7 200 0)

    arc 17 18 (0 220 30)
    arc 18 21 (10 230 30)
    arc 21 22 (0 240 30)
    arc 22 17 (-10 230 30)
    arc 16 19 (0 223 30)
    arc 19 20 (7 230 30)
    arc 20 23 (0 237 30)
    arc 23 16 (-7 230 30)
    
    arc 25 26 (0 220 430)
    arc 26 29 (10 230 430)
    arc 29 30 (0 240 430)
    arc 30 25 (-10 230 430)
    arc 24 27 (0 223 430)
    arc 27 28 (7 230 430)
    arc 28 31 (0 237 430)
    arc 31 24 (-7 230 430)

    // Arcs to define the bend curvature (RECALCULATED FOR ACCURACY)
    // Inner-side of bend
    arc 8  16 (-4.94975 217.7132 12.2868)
    arc 11 19 ( 4.94975 217.7132 12.2868)
    // Outer-side of bend
    arc 9  17 (-7.07107 216.2132 13.7868)
    arc 10 18 ( 7.07107 216.2132 13.7868)
    // Far-outer side of bend
    arc 13 21 ( 7.07107 226.2132  3.7868)
    arc 14 22 (-7.07107 226.2132  3.7868)
    // Far-inner side of bend
    arc 12 20 ( 4.94975 224.7137  5.2863)
    arc 15 23 (-4.94975 224.7137  5.2863)
);

boundary
(
    inlet
    {
        type    patch;
        faces
        (
            (0 1 2 3) (3 2 5 4) (4 5 6 7) (7 6 1 0) (0 3 4 7)
        );
    }
    outlet
    {
        type    patch;
        faces
        (
            (24 25 26 27) (27 26 29 28) (28 29 30 31) (31 30 25 24) (24 27 28 31)
        );
    }
    walls
    {
        type    wall;
        faces
        (
            (1 9 10 2) (2 10 13 5) (5 13 14 6) (6 14 9 1)
            (9 17 18 10) (10 18 21 13) (13 21 22 14) (14 22 17 9)
            (17 25 26 18) (18 26 29 21) (21 29 30 22) (22 30 25 17)
        );
    }
);

// ************************************************************************* //